In [ ]:
import pandas as pd

In [2]:
estudiantes = pd.read_csv("estudiantes.csv")
print(estudiantes)

        NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
0       Victor    23      M          Diseño Grafico  Segundo
1       Josefa    15      F  Desarrollo de software  Primero
2         Raul    30      M          Diseño Grafico  Tercero
3      Nayrobi    20      F              Enfermeria  Primero
4    Anastasia    40      F             Gastronomia  Segundo
..         ...   ...    ...                     ...      ...
139       José    19      M          Trabajo Social  Primero
140       Juan    21      M           Audiovisuales  Primero
141      Sofia    33      F        Ingeniería Civil  Segundo
142      Karla    27      F              Psicología  Primero
143    Ricardo    35      M           Audiovisuales   Cuarto

[144 rows x 5 columns]

In [3]:
estudiantes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   NOMBRE    144 non-null    object
 1   EDAD      144 non-null    int64
 2   GENERO    144 non-null    object
 3   CARRERA   144 non-null    object
 4   SEMESTRE  144 non-null    object
dtypes: int64(1), object(4)
memory usage: 5.8+ KB

In [4]:
estudiantes.head()

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
0     Victor    23      M          Diseño Grafico  Segundo
1     Josefa    15      F  Desarrollo de software  Primero
2       Raul    30      M          Diseño Grafico  Tercero
3    Nayrobi    20      F              Enfermeria  Primero
4  Anastasia    40      F             Gastronomia  Segundo

In [5]:
estudiantes.head(8)

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
0     Victor    23      M          Diseño Grafico  Segundo
1     Josefa    15      F  Desarrollo de software  Primero
2       Raul    30      M          Diseño Grafico  Tercero
3    Nayrobi    20      F              Enfermeria  Primero
4  Anastasia    40      F             Gastronomia  Segundo
5    Rolando    40      M           Audiovisuales  Segundo
6     Carlos    15      M           Audiovisuales  Segundo
7      Pedro    13      M  Desarrollo de software  Primero

In [6]:
estudiantes.tail()

      NOMBRE  EDAD GENERO           CARRERA SEMESTRE
139     José    19      M    Trabajo Social  Primero
140     Juan    21      M     Audiovisuales  Primero
141    Sofia    33      F  Ingeniería Civil  Segundo
142    Karla    27      F        Psicología  Primero
143  Ricardo    35      M     Audiovisuales   Cuarto

In [16]:
#Filtrar datos según posición o según el nombre: iloc([indiceFila, Indicecolumna]), loc([indiceFila, nombreColumna])

estudiantes.iloc[3:6, 0:3]

      NOMBRE  EDAD GENERO
3    Nayrobi    20      F
4  Anastasia    40      F
5    Rolando    40      M

In [18]:
estudiantes.loc[3:5, 'NOMBRE':'GENERO']

      NOMBRE  EDAD GENERO
3    Nayrobi    20      F
4  Anastasia    40      F
5    Rolando    40      M

In [21]:
#Filtrar solo la información de anastasia

estudiantes.iloc[4,0:4]
estudiantes[estudiantes["NOMBRE"] == "Anastasia"]

      NOMBRE  EDAD GENERO      CARRERA SEMESTRE
4  Anastasia    40      F  Gastronomia  Segundo

In [24]:
#Filtrar hombres mayores de 30

estudiantes[(estudiantes["GENERO"]=="M") &  (estudiantes["EDAD"]>30)]

       NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
5     Rolando    40      M           Audiovisuales  Segundo
11   Fernando    33      M  Desarrollo de software  Primero
21    Roberto    31      M               Marketing  Segundo
32    Antonio    35      M       Diseño Industrial   Quinto
36     Marcos    33      M        Ingeniería Civil   Cuarto
43      Oscar    36      M           Audiovisuales   Cuarto
45    Joaquín    32      M              Psicología  Tercero
50       Raúl    31      M     Ingeniería Mecánica  Tercero
53     Carlos    36      M                Medicina   Cuarto
64    Ricardo    40      M          Diseño Gráfico   Quinto
66   Santiago    33      M        Ingeniería Civil   Cuarto
68     Miguel    35      M               Marketing  Segundo
78      Félix    33      M                Economía   Cuarto
82   Leonardo    31      M  Ingeniería en Sistemas   Cuarto
90    Ricardo    37      M  Ingeniería en Sistemas   Quinto
94       José    35      M        Ingeniería Civil  Segundo
103      Raul    32      M   Ingeniería Industrial   Cuarto
114      José    34      M        Ingeniería Civil   Quinto
120      Juan    40      M              Publicidad   Cuarto
124    Arturo    33      M                 Química   Cuarto
129     César    32      M          Diseño Gráfico  Segundo
143   Ricardo    35      M           Audiovisuales   Cuarto

In [27]:
#edad promedio
estudiantes["EDAD"].mean()

np.float64(27.65972222222222)

In [28]:
#edad maxima
estudiantes["EDAD"].max()

np.int64(77)

In [29]:
# edad minima
estudiantes["EDAD"].min()

np.int64(13)

In [30]:
# desviacion standar edad 
estudiantes["EDAD"].std()

np.float64(8.415905017581725)

In [32]:
estudiantes = {"Nombre": ["Laura", "Fernando", "Pedro"],
               "Ocupacion":["Docente", "Futbolista", "Entrenador"]
               }

df = pd.DataFrame(estudiantes)
df

     Nombre   Ocupacion
0     Laura     Docente
1  Fernando  Futbolista
2     Pedro  Entrenador